{
    "logs":
        [ 
            {
                "id": "log-2025-week-6-day2",
                "title": "Log opsætning.",
                "date": "2025-02-05",
                "content": [
                {
                    "type": "text",
                    "value": "I dag har jeg for det meste kun arbejdet på at få sat denne side, som du lige nu sidder og læser på, op. Øhh ja, jeg skriver først nu her hvor jeg er færdig såååå."
                },
                {
                    "type": "image",
                    "src": "https://cdn.7tv.app/emote/01FC1B04XR000E3W5GESZFF1AY/4x.png"
                },
                {
                    "type": "text",
                    "value": "De næste indslag på denne blog vil højst sandsynlig have mere struktur, samt potentielle skitseringer. Dette indslag er mere bare en test for at sige det sådan."
                }
                ]
            },
            {
                "id": "log-2026-week-6-day4",
                "title": "Læringsmål, planer og over-engineering.",
                "date": "2026-02-06",
                "content": [
                {
                    "type": "text",
                    "value": "I dag har jeg for det meste arbejdet på, at få sat nogle læringsmål, samt planer op.\nDerudover har jeg brugt det meste af dagen på, at skulle være tilstæde til en workshop vi afholdte i XR Lab. Så jeg har dermed ikke kunne lave så meget arbejde.\n\nEn af grundidéerne er at genbruge den filtrering og sortering, der findes på blogsiden, og implementere den tilsvarende på kildesiden."
                },
                {
                    "type": "image",
                    "src": "/images/blogImages/week6/friday/sortImage.png"
                },
                {
                    "type": "text",
                    "value": "Dog er jeg usikker på, om jeg når det i dag.\n\nMen det grundlæggende, som jeg skal have op og køre i dag, er mine lærings planer. Især fordi at dem har jeg overhovedet ikke tænkt over at udarbejde, før nu."
                },
                {
                    "type": "image",
                    "src": "https://cdn.7tv.app/emote/01GQF7KXJ8000ERT2YB38Q65VR/3x.gif"
                },
                {
                    "type": "text",
                    "value": "Det bliver dog lidt mere besværligt at få sortering udarbejdet for mine kilder...\nHvad skal der kunne filtreres for? Hvordan skal man kunne sorterer dem?\nBliver dette portfølje over-engineered? (det er det fanme allerede)"
                },
                {
                    "type": "image",
                    "src": "https://cdn.7tv.app/emote/01FC1B04XR000E3W5GESZFF1AY/4x.png"
                }
                ]
            },
            {
                "id": "log-2026-week-7-day1",
                "title": "Refaktorering af arkitektur og struktur.",
                "date": "2026-02-09",
                "content": [
                    {
                        "type": "text",
                        "value": "I dag lå jeg desværre syg, så jeg havde ikke overskud til at gå i dybden med at læse. Jeg havde dog fået nogle tilbagemeldinger fra venner, som også arbejder med Vue.js, om at den generelle struktur for mit porteføljeprojekt var uoverskuelig og hurtigt kunne gå galt."
                    },
                    {
                        "type": "image",
                        "src": "/images/blogImages/week7/monday/codeFeedback.png"
                    },
                    {
                        "type": "text",
                        "value": "Derfor valgte jeg at bruge det meste af dagen på at arbejde med projektets struktur. Det gav mig samtidig en bedre idé og et stærkere grundlag for, hvordan jeg fremadrettet kan strukturere selve projektet i min projektgruppe."
                    },
                    {
                        "type": "image",
                        "src": "/images/blogImages/week7/monday/fixedCode.png"
                    },
                    {
                        "type": "text",
                        "value": "Efter refaktoreringen lever arkitekturen i langt højere grad op til principper som high cohesion og low coupling. Samtidig er der kommet mere fokus på separation of concerns, hvilket gør at projektet bedre følger Single Responsibility Principle."
                    },
                    {
                        "type": "image",
                        "src": "https://cdn.7tv.app/emote/01G9JW7WY80003SW3KYSMQE9YY/2x.gif"
                    }
                ]
            }
            
    ]
}
    